const MORSE_TABLE = {
    '.-':     'a',
    '-...':   'b',
    '-.-.':   'c',
    '-..':    'd',
    '.':      'e',
    '..-.':   'f',
    '--.':    'g',
    '....':   'h',
    '..':     'i',
    '.---':   'j',
    '-.-':    'k',
    '.-..':   'l',
    '--':     'm',
    '-.':     'n',
    '---':    'o',
    '.--.':   'p',
    '--.-':   'q',
    '.-.':    'r',
    '...':    's',
    '-':      't',
    '..-':    'u',
    '...-':   'v',
    '.--':    'w',
    '-..-':   'x',
    '-.--':   'y',
    '--..':   'z',
    '.----':  '1',
    '..---':  '2',
    '...--':  '3',
    '....-':  '4',
    '.....':  '5',
    '-....':  '6',
    '--...':  '7',
    '---..':  '8',
    '----.':  '9',
    '-----':  '0',
};

function decode(expr) {
    let result = ''; // строка для хранения результата

    // Проходим по строке, деля её на части по 10 символов
    for (let i = 0; i < expr.length; i += 10) {
        let letter = expr.slice(i, i + 10); // выделяем по 10 символов
        
        // Если это пробел
        if (letter === '**********') {
            result += ' '; // добавляем пробел
            continue;
        }

        // Убираем ведущие нули
        letter = letter.replace(/^0+/, '');

        // Преобразуем числовое представление в точки и тире
        let morseCode = '';
        for (let j = 0; j < letter.length; j += 2) {
            let pair = letter.slice(j, j + 2);
            if (pair === '10') morseCode += '.';
            if (pair === '11') morseCode += '-';
        }

        // Переводим код Морзе в символ и добавляем его к результату
        result += MORSE_TABLE[morseCode];
    }

    return result;
}

module.exports = {
    decode
}